Revit 2015 API
BooleanOperationsUtils Methods
The BooleanOperationsUtils type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
ExecuteBooleanOperation
 Perform a boolean geometric operation between two solids, and return a new solid to represent the result.
ExecuteBooleanOperationModifyingOriginalSolid
 Perform a boolean geometric operation between two solids, and modify the original solid to represent the result.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
BooleanOperationsUtils Class
Autodesk.Revit.DB Namespace